package chap03.changecalc;

/*
 * 	거스름돈 계산기
 * 		- 문제 : 거스름돈을 최소 개수의 지폐/동전으로 구성하기
 * 
 * 		- 예시 : 거스름돈 2,660원을 거슬러줄 때
 * 			- 방법1: 1000원 * 2 + 500원 * 1 + 100원 * 1 + 50원 * 1 + 10원 * 1 = 6개 (최적!)
 * 		      방법2: 500원*5 + 100원*1 + 50원*1 + 10원*1 = 8개
 * 			  방법3: 100원*26 + 50원*1 + 10원*1 = 28개	
 * 
 * 		- 해결 : Greey Algorithm(탐욕 알고리즘) 적용
 * 				- 큰 단위부터 최대한 사용하면 최소 개수로 거슬러줄 수 있음 
 * 				- 단, 한국 화폐처럼 단위가 서로 배수 관계일 때만 최적해 보장
 * 
 */
public class ChangeCalculatorExtended {

}




















